tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F86K22_H_
#define _PIC18F86K22_H_

#define PMD3                          0
#define TMR12MD                       1
#define CCP4MD                        2
#define CCP5MD                        3
#define CCP6MD                        4
#define CCP7MD                        5
#define CCP8MD                        6
#define CCP9MD                        7
#define CCP10MD                       8
#define PMD2                          9
#define CMP1MD                        10
#define CMP2MD                        11
#define CMP3MD                        12
#define TMR5MD                        13
#define TMR6MD                        14
#define TMR7MD                        15
#define TMR8MD                        16
#define TMR10MD                       17
#define PMD1                          18
#define EMBMD                         19
#define TMR1MD                        20
#define TMR2MD                        21
#define TMR3MD                        22
#define TMR4MD                        23
#define RTCCMD                        24
#define CTMUMD                        25
#define PSPMD                         26
#define PMD0                          27
#define ADCMD                         28
#define SSP1MD                        29
#define SPI1MD                        30
#define SPI2MD                        31
#define SSP2MD                        32
#define UART1MD                       33
#define UART2MD                       34
#define CCP1MD                        35
#define CCP2MD                        36
#define CCP3MD                        37
#define PSTR3CON                      38
#define PSTR3CON_STRA                 39
#define STRA3                         40
#define STRB3                         41
#define PSTR3CON_STRB                 42
#define PSTR3CON_STRC                 43
#define STRC3                         44
#define STRD3                         45
#define PSTR3CON_STRD                 46
#define STRSYNC3                      47
#define PSTR3CON_STRSYNC              48
#define PSTR3CON_CMPL0                49
#define CMPL03                        50
#define PSTR3CON_CMPL                 51
#define CMPL13                        52
#define PSTR3CON_CMPL1                53
#define PSTR2CON                      54
#define PSTR2CON_STRA                 55
#define P2DC02                        56
#define STRA2                         57
#define P2DC0CON                      58
#define STRB2                         59
#define P2DC12                        60
#define PSTR2CON_STRB                 61
#define P2DC1CON                      62
#define STRC2                         63
#define PSTR2CON_STRC                 64
#define P2DC22                        65
#define P2DC2CON                      66
#define P2DC32                        67
#define STRD2                         68
#define PSTR2CON_STRD                 69
#define P2DC3CON                      70
#define P2DC4CON                      71
#define STRSYNC2                      72
#define PSTR2CON_STRSYNC              73
#define P2DC42                        74
#define P2DC6CON                      75
#define PSTR2CON_CMPL                 76
#define CMPL02                        77
#define P2DC62                        78
#define PSTR2CON_CMPL0                79
#define CMPL12                        80
#define PSTR2CON_CMPL1                81
#define TXREG2                        82
#define RCREG2                        83
#define SPBRG2                        84
#define SPBRGH2                       85
#define BAUDCON2                      86
#define ABDEN2                        87
#define BAUDCON2_ABDEN                88
#define WUE2                          89
#define BAUDCON2_WUE                  90
#define BRG162                        91
#define BAUDCON2_BRG16                92
#define SCKP2                         93
#define TXCKP2                        94
#define BAUDCON2_TXCKP                95
#define DTRXP2                        96
#define RXDTP2                        97
#define BAUDCON2_RXDTP                98
#define RCMT2                         99
#define RCIDL2                        100
#define BAUDCON2_RCIDL                101
#define BAUDCON2_ABDOVF               102
#define ABDOVF2                       103
#define TXSTA2                        104
#define TX9D2                         105
#define TXSTA2_TX9D                   106
#define TXD82                         107
#define TRMT2                         108
#define TXSTA2_TRMT                   109
#define BRGH2                         110
#define TXSTA2_BRGH                   111
#define SENDB2                        112
#define TXSTA2_SENDB                  113
#define TXSTA2_SYNC                   114
#define SYNC2                         115
#define TXEN2                         116
#define TXSTA2_TXEN                   117
#define TX8_92                        118
#define TX92                          119
#define TXSTA2_TX9                    120
#define TXSTA2_CSRC                   121
#define CSRC2                         122
#define RCSTA2                        123
#define RCD82                         124
#define RX9D2                         125
#define RCSTA2_RX9D                   126
#define OERR2                         127
#define RCSTA2_OERR                   128
#define FERR2                         129
#define RCSTA2_FERR                   130
#define ADDEN2                        131
#define RCSTA2_ADDEN                  132
#define RCSTA2_CREN                   133
#define CREN2                         134
#define SREN2                         135
#define RCSTA2_SREN                   136
#define RC92                          137
#define RC8_92                        138
#define RCSTA2_RX9                    139
#define RX92                          140
#define RCSTA2_SPEN                   141
#define SPEN2                         142
#define ANCON2                        143
#define PCFG16                        144
#define ANSEL16                       145
#define PCFG17                        146
#define ANSEL17                       147
#define PCFG18                        148
#define ANSEL18                       149
#define PCFG19                        150
#define ANSEL19                       151
#define ANSEL20                       152
#define PCFG20                        153
#define ANSEL21                       154
#define PCFG21                        155
#define ANSEL22                       156
#define PCFG22                        157
#define ANSEL23                       158
#define PCFG23                        159
#define ANCON1                        160
#define ANSEL8                        161
#define PCFG8                         162
#define ANSEL9                        163
#define PCFG9                         164
#define PCFG10                        165
#define ANSEL10                       166
#define ANSEL11                       167
#define PCFG11                        168
#define PCFG12                        169
#define ANSEL12                       170
#define PCFG13                        171
#define ANSEL13                       172
#define PCFG14                        173
#define ANSEL14                       174
#define PCFG15                        175
#define ANSEL15                       176
#define ANCON0                        177
#define ANSEL0                        178
#define PCFG0                         179
#define ANSEL1                        180
#define PCFG1                         181
#define ANSEL2                        182
#define PCFG2                         183
#define ANSEL3                        184
#define PCFG3                         185
#define ANSEL4                        186
#define PCFG4                         187
#define ANSEL5                        188
#define PCFG5                         189
#define ANSEL6                        190
#define PCFG6                         191
#define ANSEL7                        192
#define PCFG7                         193
#define MEMCON                        194
#define WM                            195
#define WM0                           196
#define WM1                           197
#define WAIT0                         198
#define WAIT                          199
#define WAIT1                         200
#define EBDIS                         201
#define ODCON3                        202
#define CTMUDS                        203
#define U1OD                          204
#define U2OD                          205
#define ODCON2                        206
#define CCP3OD                        207
#define CCP4OD                        208
#define CCP5OD                        209
#define CCP6OD                        210
#define CCP7OD                        211
#define CCP8OD                        212
#define CCP9OD                        213
#define CCP10OD                       214
#define ODCON1                        215
#define SPI2OD                        216
#define CCP1OD                        217
#define CCP2OD                        218
#define SPI1OD                        219
#define REFOCON                       220
#define RODIV0                        221
#define RODIV                         222
#define RODIV1                        223
#define RODIV2                        224
#define RODIV3                        225
#define ROSEL                         226
#define ROSSLP                        227
#define ROON                          228
#define CCPTMRS2                      229
#define C8TSEL0                       230
#define C8TSEL                        231
#define C8TSEL1                       232
#define C9TSEL0                       233
#define C10TSEL0                      234
#define CCPTMRS1                      235
#define C4TSEL                        236
#define C4TSEL0                       237
#define C4TSEL1                       238
#define C5TSEL0                       239
#define C6TSEL0                       240
#define C7TSEL                        241
#define C7TSEL0                       242
#define C7TSEL1                       243
#define CCPTMRS0                      244
#define C1TSEL0                       245
#define C1TSEL                        246
#define C1TSEL1                       247
#define C1TSEL2                       248
#define C2TSEL0                       249
#define C2TSEL                        250
#define C2TSEL1                       251
#define C2TSEL2                       252
#define C3TSEL0                       253
#define C3TSEL                        254
#define C3TSEL1                       255
#define CM3CON                        256
#define CM3CON_CCH                    257
#define CCH03                         258
#define CM3CON_CCH0                   259
#define CCH13                         260
#define CM3CON_CCH1                   261
#define CM3CON_CREF                   262
#define CREF3                         263
#define CM3CON_EVPOL                  264
#define EVPOL03                       265
#define CM3CON_EVPOL0                 266
#define CM3CON_EVPOL1                 267
#define EVPOL13                       268
#define CM3CON_CPOL                   269
#define CPOL3                         270
#define COE3                          271
#define CM3CON_COE                    272
#define CM3CON_CON                    273
#define CON3                          274
#define CM2CON                        275
#define CM2CON_CCH                    276
#define CM2CON_CCH0                   277
#define CCH02                         278
#define CCH12                         279
#define CM2CON_CCH1                   280
#define CM2CON_CREF                   281
#define CREF2                         282
#define CM2CON_EVPOL                  283
#define EVPOL02                       284
#define CM2CON_EVPOL0                 285
#define EVPOL12                       286
#define CM2CON_EVPOL1                 287
#define CM2CON_CPOL                   288
#define CPOL2                         289
#define CM2CON_COE                    290
#define COE2                          291
#define CM2CON_CON                    292
#define CON2                          293
#define T12CON                        294
#define T12CKPS0                      295
#define T12CKPS                       296
#define T12CKPS1                      297
#define TMR12ON                       298
#define T12OUTPS0                     299
#define T12OUTPS                      300
#define T12OUTPS1                     301
#define T12OUTPS2                     302
#define T12OUTPS3                     303
#define PR12                          304
#define TMR12                         305
#define T10CON                        306
#define T10CKPS                       307
#define T10CKPS0                      308
#define T10CKPS1                      309
#define TMR10ON                       310
#define T10OUTPS0                     311
#define T10OUTPS                      312
#define T10OUTPS1                     313
#define T10OUTPS2                     314
#define T10OUTPS3                     315
#define PR10                          316
#define TMR10                         317
#define T8CON                         318
#define T8CKPS0                       319
#define T8CKPS                        320
#define T8CKPS1                       321
#define TMR8ON                        322
#define T8OUTPS                       323
#define T8OUTPS0                      324
#define T8OUTPS1                      325
#define T8OUTPS2                      326
#define T8OUTPS3                      327
#define PR8                           328
#define TMR8                          329
#define T6CON                         330
#define T6CKPS0                       331
#define T6CKPS                        332
#define T6CKPS1                       333
#define TMR6ON                        334
#define T6OUTPS0                      335
#define T6OUTPS                       336
#define T6OUTPS1                      337
#define T6OUTPS2                      338
#define T6OUTPS3                      339
#define PR6                           340
#define TMR6                          341
#define T7GCON                        342
#define T7GSS0                        343
#define T7GSS                         344
#define T7GSS1                        345
#define T7GVAL                        346
#define nT7DONE                       347
#define T7GGO_NOT_T7DONE              348
#define NOT_T7DONE                    349
#define T7GGO_nT7DONE                 350
#define T7GGO                         351
#define T7GSPM                        352
#define T7GTM                         353
#define T7GPOL                        354
#define TMR7GE                        355
#define T7CON                         356
#define TMR7ON                        357
#define T7CON_RD16                    358
#define RD167                         359
#define nT7SYNC                       360
#define NOT_T7SYNC                    361
#define SOSCEN7                       362
#define T7CON_SOSCEN                  363
#define T7CKPS                        364
#define T7CKPS0                       365
#define T7CKPS1                       366
#define TMR7CS                        367
#define TMR7CS0                       368
#define TMR7CS1                       369
#define TMR7L                         370
#define CAL07                         371
#define CAL17                         372
#define CAL27                         373
#define CAL37                         374
#define CAL47                         375
#define CAL57                         376
#define CAL67                         377
#define CAL77                         378
#define TMR7H                         379
#define CCP10CON                      380
#define CCP10M                        381
#define CCP10M0                       382
#define CCP10M1                       383
#define CCP10M2                       384
#define CCP10M3                       385
#define CCP10Y                        386
#define DC10B0                        387
#define DC10B                         388
#define CCP10X                        389
#define DC10B1                        390
#define CCPR10L                       391
#define CCPR10H                       392
#define CCP9CON                       393
#define CCP9M0                        394
#define CCP9M                         395
#define CCP9M1                        396
#define CCP9M2                        397
#define CCP9M3                        398
#define CCP9Y                         399
#define DC9B0                         400
#define DC9B                          401
#define CCP9X                         402
#define DC9B1                         403
#define CCPR9L                        404
#define CCPR9H                        405
#define CCP8CON                       406
#define CCP8M0                        407
#define CCP8M                         408
#define CCP8M1                        409
#define CCP8M2                        410
#define CCP8M3                        411
#define DC8B0                         412
#define CCP8Y                         413
#define DC8B                          414
#define DC8B1                         415
#define CCP8X                         416
#define CCPR8L                        417
#define CCPR8H                        418
#define CCP3CON                       419
#define CCP3M                         420
#define CCP3M0                        421
#define CCP3M1                        422
#define CCP3M2                        423
#define CCP3M3                        424
#define DC3B                          425
#define DC3B0                         426
#define DC3B1                         427
#define P3M                           428
#define P3M0                          429
#define P3M1                          430
#define CCPR3L                        431
#define CCPR3H                        432
#define ECCP3DEL                      433
#define P3DC                          434
#define P3DC0                         435
#define P3DC1                         436
#define P3DC2                         437
#define P3DC3                         438
#define P3DC4                         439
#define P3DC5                         440
#define P3DC6                         441
#define P3RSEN                        442
#define PSS3BD0                       443
#define PSS3BD                        444
#define PSS3BD1                       445
#define PSS3AC0                       446
#define PSS3AC                        447
#define PSS3AC1                       448
#define ECCP3AS                       449
#define ECCP3AS0                      450
#define ECCP3AS1                      451
#define ECCP3AS2                      452
#define ECCP3ASE                      453
#define CCP2CON                       454
#define CCP2M                         455
#define CCP2M0                        456
#define CCP2M1                        457
#define CCP2M2                        458
#define CCP2M3                        459
#define DC2B                          460
#define DC2B0                         461
#define CCP2Y                         462
#define DC2B1                         463
#define CCP2X                         464
#define P2M                           465
#define P2M0                          466
#define P2M1                          467
#define CCPR2L                        468
#define CCPR2H                        469
#define ECCP2DEL                      470
#define P2DC                          471
#define P2DC0                         472
#define P2DC1                         473
#define P2DC2                         474
#define P2DC3                         475
#define P2DC4                         476
#define P2DC5                         477
#define P2DC6                         478
#define P2RSEN                        479
#define PSS2BD                        480
#define PSS2BD0                       481
#define PSS2BD1                       482
#define PSS2AC0                       483
#define PSS2AC                        484
#define PSS2AC1                       485
#define ECCP2AS0                      486
#define ECCP2AS                       487
#define ECCP2AS1                      488
#define ECCP2AS2                      489
#define ECCP2ASE                      490
#define PADCFG1                       491
#define RTSECSEL0                     492
#define RTSECSEL                      493
#define RTSECSEL1                     494
#define PADCFG1_RJPU                  495
#define REPU                          496
#define RDPU                          497
#define CM1CON                        498
#define CM1CON_CCH                    499
#define C1CH0                         500
#define CM1CON_CCH0                   501
#define CCH01                         502
#define CCH11                         503
#define C1CH1                         504
#define CM1CON_CCH1                   505
#define CM1CON_CREF                   506
#define CREF1                         507
#define EVPOL01                       508
#define CM1CON_EVPOL0                 509
#define CM1CON_EVPOL                  510
#define CM1CON_EVPOL1                 511
#define EVPOL11                       512
#define CM1CON_CPOL                   513
#define CPOL1                         514
#define CM1CON_COE                    515
#define COE1                          516
#define CM1CON_CON                    517
#define CON1                          518
#define CTMUICON                      519
#define IRNG                          520
#define IRNG0                         521
