tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k22_tdd.h
#define IRNG1                         522
#define ITRIM0                        523
#define ITRIM                         524
#define ITRIM1                        525
#define ITRIM2                        526
#define ITRIM3                        527
#define ITRIM4                        528
#define ITRIM5                        529
#define CTMUCONL                      530
#define EDG1STAT                      531
#define EDG2STAT                      532
#define EDG1SEL                       533
#define EDG1SEL0                      534
#define EDG1SEL1                      535
#define EDG1POL                       536
#define EDG2SEL0                      537
#define EDG2SEL                       538
#define EDG2SEL1                      539
#define EDG2POL                       540
#define CTMUCONH                      541
#define CTTRIG                        542
#define IDISSEN                       543
#define EDGSEQEN                      544
#define EDGEN                         545
#define TGEN                          546
#define CTMUSIDL                      547
#define CTMUEN                        548
#define ALRMVALL                      549
#define ALRMVALH                      550
#define ALRMRPT                       551
#define ARPT0                         552
#define ARPT                          553
#define ARPT1                         554
#define ARPT2                         555
#define ARPT3                         556
#define ARPT4                         557
#define ARPT5                         558
#define ARPT6                         559
#define ARPT7                         560
#define ALRMCFG                       561
#define ALRMPTR                       562
#define ALRMPTR0                      563
#define ALRMPTR1                      564
#define AMASK0                        565
#define AMASK                         566
#define AMASK1                        567
#define AMASK2                        568
#define AMASK3                        569
#define CHIME                         570
#define ALRMEN                        571
#define RTCVALL                       572
#define WAITE0                        573
#define RTCVALH                       574
#define WAITE1                        575
#define WAITM0                        576
#define WAITM1                        577
#define WAITM2                        578
#define WAITM3                        579
#define WAITB0                        580
#define WAITB1                        581
#define RTCCAL                        582
#define CAL0                          583
#define CAL                           584
#define CAL1                          585
#define CAL2                          586
#define CAL3                          587
#define CAL4                          588
#define CAL5                          589
#define CAL6                          590
#define CAL7                          591
#define RTCCFG                        592
#define RTCPTR0                       593
#define RTCPTR                        594
#define RTCPTR1                       595
#define RTCOE                         596
#define HALFSEC                       597
#define RTCSYNC                       598
#define RTCWREN                       599
#define RTCEN                         600
#define PIE6                          601
#define CMP1IE                        602
#define CMP2IE                        603
#define CMP3IE                        604
#define EEIE                          605
#define EEDATA                        606
#define EEADR                         607
#define EEADRH                        608
#define OSCCON2                       609
#define MFIOSEL                       610
#define MFIOFS                        611
#define SOSCGO                        612
#define SOSCRUN                       613
#define BAUDCON1                      614
#define BAUDCON1_ABDEN                615
#define ABDEN1                        616
#define BAUDCON1_WUE                  617
#define WUE1                          618
#define W4E                           619
#define BRG161                        620
#define BAUDCON1_BRG16                621
#define CKTXP                         622
#define BAUDCON1_TXCKP                623
#define SCKP1                         624
#define TXCKP1                        625
#define SCKP                          626
#define DTRXP1                        627
#define RXDTP1                        628
#define DTRXP                         629
#define RXCKP                         630
#define BAUDCON1_RXDTP                631
#define RCMT1                         632
#define RCIDL1                        633
#define BAUDCON1_RCIDL                634
#define RCMT                          635
#define ABDOVF1                       636
#define BAUDCON1_ABDOVF               637
#define SSP2CON2                      638
#define SEN2                          639
#define SSP2CON2_SEN                  640
#define ADMSK12                       641
#define SSP2CON2_RSEN                 642
#define RSEN2                         643
#define SSP2CON2_ADMSK1               644
#define ADMSK22                       645
#define PEN2                          646
#define SSP2CON2_PEN                  647
#define SSP2CON2_ADMSK2               648
#define ADMSK32                       649
#define SSP2CON2_RCEN                 650
#define RCEN2                         651
#define SSP2CON2_ADMSK3               652
#define ACKEN2                        653
#define ADMSK42                       654
#define SSP2CON2_ADMSK4               655
#define SSP2CON2_ACKEN                656
#define ACKDT2                        657
#define ADMSK52                       658
#define SSP2CON2_ACKDT                659
#define SSP2CON2_ADMSK5               660
#define SSP2CON2_ACKSTAT              661
#define ACKSTAT2                      662
#define SSP2CON2_GCEN                 663
#define GCEN2                         664
#define SSP2CON1                      665
#define SSP2CON1_SSPM                 666
#define SSP2CON1_SSPM0                667
#define SSPM02                        668
#define SSPM12                        669
#define SSP2CON1_SSPM1                670
#define SSP2CON1_SSPM2                671
#define SSPM22                        672
#define SSPM32                        673
#define SSP2CON1_SSPM3                674
#define SSP2CON1_CKP                  675
#define CKP2                          676
#define SSPEN2                        677
#define SSP2CON1_SSPEN                678
#define SSPOV2                        679
#define SSP2CON1_SSPOV                680
#define WCOL2                         681
#define SSP2CON1_WCOL                 682
#define SSP2STAT                      683
#define SSP2STAT_BF                   684
#define BF2                           685
#define SSP2STAT_UA                   686
#define UA2                           687
#define SSP2STAT_R_W                  688
#define SSP2STAT_I2C_READ             689
#define RW2                           690
#define SSP2STAT_R                    691
#define SSP2STAT_nW                   692
#define READ_WRITE2                   693
#define nW2                           694
#define SSP2STAT_nWRITE               695
#define I2C_READ2                     696
#define SSP2STAT_R_NOT_W              697
#define R_nW2                         698
#define SSP2STAT_READ_WRITE           699
#define nWRITE2                       700
#define R_W2                          701
#define SSP2STAT_R_nW                 702
#define SSP2STAT_NOT_WRITE            703
#define SSP2STAT_S                    704
#define S2                            705
#define START2                        706
#define SSP2STAT_I2C_START            707
#define I2C_START2                    708
#define P2                            709
#define SSP2STAT_I2C_STOP             710
#define SSP2STAT_P                    711
#define STOP2                         712
#define I2C_STOP2                     713
#define I2C_DAT2                      714
#define SSP2STAT_D                    715
#define DATA_ADDRESS2                 716
#define SSP2STAT_D_NOT_A              717
#define SSP2STAT_I2C_DAT              718
#define D_A2                          719
#define SSP2STAT_NOT_ADDRESS          720
#define SSP2STAT_D_nA                 721
#define SSP2STAT_DATA_ADDRESS         722
#define SSP2STAT_nADDRESS             723
#define nA2                           724
#define DA2                           725
#define nADDRESS2                     726
#define D_nA2                         727
#define SSP2STAT_nA                   728
#define SSP2STAT_D_A                  729
#define SSP2STAT_CKE                  730
#define CKE2                          731
#define SSP2STAT_SMP                  732
#define SMP2                          733
#define MSK02                         734
#define SSP2ADD                       735
#define MSK12                         736
#define MSK22                         737
#define MSK32                         738
#define MSK42                         739
#define MSK52                         740
#define MSK62                         741
#define MSK72                         742
#define SSP2MSK                       743
#define SSP2MSK_MSK0                  744
#define SSP2MSK_MSK1                  745
#define SSP2MSK_MSK2                  746
#define SSP2MSK_MSK3                  747
#define SSP2MSK_MSK4                  748
#define SSP2MSK_MSK5                  749
#define SSP2MSK_MSK6                  750
#define SSP2MSK_MSK7                  751
#define SSP2BUF                       752
#define T4CON                         753
#define T4CKPS0                       754
#define T4CKPS                        755
#define T4CKPS1                       756
#define TMR4ON                        757
#define T4OUTPS                       758
#define T4OUTPS0                      759
#define T4OUTPS1                      760
#define T4OUTPS2                      761
#define T4OUTPS3                      762
#define PR4                           763
#define TMR4                          764
#define CCP7CON                       765
#define CCP7M0                        766
#define CCP7M                         767
#define CCP7M1                        768
#define CCP7M2                        769
#define CCP7M3                        770
#define DC7B                          771
#define CCP7Y                         772
#define DC7B0                         773
#define CCP7X                         774
#define DC7B1                         775
#define CCPR7L                        776
#define CCPR7H                        777
#define CCP6CON                       778
#define CCP6M                         779
#define CCP6M0                        780
#define CCP6M1                        781
#define CCP6M2                        782
#define CCP6M3                        783
#define CCP6Y                         784
#define DC6B0                         785
#define DC6B                          786
#define DC6B1                         787
#define CCP6X                         788
#define CCPR6L                        789
#define CCPR6H                        790
#define CCP5CON                       791
#define CCP5M0                        792
#define CCP5M                         793
#define CCP5M1                        794
#define CCP5M2                        795
#define CCP5M3                        796
#define CCP5Y                         797
#define DC5B0                         798
#define DC5B                          799
#define CCP5X                         800
#define DC5B1                         801
#define CCPR5L                        802
#define CCPR5H                        803
#define CCP4CON                       804
#define CCP4M                         805
#define CCP4M0                        806
#define CCP4M1                        807
#define CCP4M2                        808
#define CCP4M3                        809
#define CCP4Y                         810
#define DC4B0                         811
#define DC4B                          812
#define CCP4X                         813
#define DC4B1                         814
#define CCPR4L                        815
#define CCPR4H                        816
#define T5GCON                        817
#define T5GSS                         818
#define T5GSS0                        819
#define T5GSS1                        820
#define T5GVAL                        821
#define T5GGO_NOT_T5DONE              822
#define nT5DONE                       823
#define T5GGO_nT5DONE                 824
#define NOT_T5DONE                    825
#define T5GGO                         826
#define T5GSPM                        827
#define T5GTM                         828
#define T5GPOL                        829
#define TMR5GE                        830
#define T5CON                         831
#define TMR5ON                        832
#define T5CON_RD16                    833
#define RD165                         834
#define nT5SYNC                       835
#define NOT_T5SYNC                    836
#define SOSCEN5                       837
#define T5CON_SOSCEN                  838
#define T5CKPS                        839
#define T5CKPS0                       840
#define T5CKPS1                       841
#define TMR5CS0                       842
#define TMR5CS                        843
#define TMR5CS1                       844
#define TMR5L                         845
#define TMR5H                         846
#define EECON2                        847
#define EECON1                        848
#define RD                            849
#define WR                            850
#define WREN                          851
#define WRERR                         852
#define FREE                          853
#define CFGS                          854
#define EEFS                          855
#define EEPGD                         856
#define PORTA                         857
#define AN0                           858
#define ULPWUIN                       859
#define ULPWU                         860
#define RA0                           861
#define AN1                           862
#define RA1                           863
#define AN2                           864
#define RA2                           865
#define VREF_MINUS                    866
#define AN3                           867
#define VREF_PLUS                     868
#define RA3                           869
#define T0CKI                         870
#define RA4                           871
#define AN4                           872
#define T1CKI                         873
#define LVDIN                         874
#define RA5                           875
#define T3G                           876
#define HLVDIN                        877
#define CLKO                          878
#define RA6                           879
#define OSC2                          880
#define CLKI                          881
#define PORTA_RJPU                    882
#define RA7                           883
#define OSC1                          884
#define PORTB                         885
#define FLT0                          886
#define RB0                           887
#define INT0                          888
#define RB1                           889
#define INT1                          890
#define RB2                           891
#define INT2                          892
#define CTED1                         893
#define RB3                           894
#define CCP2_P2A                      895
#define INT3                          896
#define CCP2_PA2                      897
#define CTED2                         898
#define RB4                           899
#define KBI0                          900
#define PGM                           901
#define T3CKI                         902
#define RB5                           903
#define KBI1                          904
#define T1G                           905
#define PGC                           906
#define RB6                           907
#define KBI2                          908
#define PGD                           909
#define RB7                           910
#define KBI3                          911
#define PORTC                         912
#define SOSCO                         913
#define SCKLI                         914
#define RC0                           915
#define PORTC_CCP2                    916
#define PA2                           917
#define RC1                           918
#define SOSCI                         919
#define PORTC_P2A                     920
#define CCP1                          921
#define P1A                           922
#define PA1                           923
#define RC2                           924
#define SCK1                          925
#define SCL1                          926
#define RC3                           927
#define SDI1                          928
#define SDA1                          929
#define RC4                           930
#define SDO1                          931
#define RC5                           932
#define TX1                           933
#define RC6                           934
#define CK1                           935
#define RX1                           936
#define RC7                           937
#define DT1                           938
#define PORTD                         939
#define PSP0                          940
#define RD0                           941
#define CTPLS                         942
#define AD0                           943
#define PSP1                          944
#define RD1                           945
#define T5CKI                         946
#define T7G                           947
#define AD1                           948
#define PSP2                          949
#define RD2                           950
#define AD2                           951
#define PSP3                          952
#define RD3                           953
#define AD3                           954
#define PSP4                          955
#define RD4                           956
#define AD4                           957
#define SDO2                          958
#define PSP5                          959
#define RD5                           960
#define SDI2                          961
#define AD5                           962
#define SDA2                          963
#define SCK2                          964
#define PSP6                          965
#define RD6                           966
#define AD6                           967
#define SCL2                          968
#define SS2                           969
#define PSP7                          970
#define RD7                           971
#define NOT_SS2                       972
#define nSS2                          973
#define AD7                           974
#define PORTE                         975
#define P2D                           976
#define NOT_RD                        977
#define nRD                           978
#define PD2                           979
#define AD8                           980
#define RDE                           981
#define RE0                           982
#define P2C                           983
#define NOT_WR                        984
#define AD9                           985
#define nWR                           986
#define WRE                           987
#define RE1                           988
#define PC2                           989
#define P2B                           990
#define nCS                           991
#define NOT_CS                        992
#define CS                            993
#define CCP10                         994
#define PB2                           995
#define AD10                          996
#define RE2                           997
#define PORTE_CCP9                    998
#define CCP9E                         999
#define P3C                           1000
#define REFO                          1001
#define AD11                          1002
#define RE3                           1003
#define PC3E                          1004
#define PORTE_CCP8                    1005
#define PB3E                          1006
#define P3B                           1007
#define AD12                          1008
#define RE4                           1009
#define CCP8E                         1010
#define PORTE_CCP7                    1011
#define P1C                           1012
#define CCP7E                         1013
#define AD13                          1014
#define RE5                           1015
#define PC1E                          1016
#define PORTE_CCP6                    1017
#define CCP6E                         1018
#define P1B                           1019
#define AD14                          1020
#define RE6                           1021
#define PB1E                          1022
#define CCP2E                         1023
#define PORTE_P2A                     1024
#define PA2E                          1025
#define PORTE_CCP2                    1026
#define AD15                          1027
#define RE7                           1028
#define PORTF                         1029
#define C2OUTF                        1030
#define AN6                           1031
#define PORTF_C2OUT                   1032
#define RF1                           1033
#define CTDIN                         1034
#define PORTF_C1OUT                   1035
#define AN7                           1036
#define RF2                           1037
#define C1OUTF                        1038
#define AN8                           1039
#define RF3                           1040
#define CTMUI                         1041
#define C2INB                         1042
#define AN9                           1043
#define RF4                           1044
#define C2INA                         1045
#define C1INB                         1046
#define RF5                           1047
#define CVREF                         1048
#define AN10                          1049
#define C1INA                         1050
#define RF6                           1051
#define AN11                          1052
#define SS1                           1053
#define AN5                           1054
#define RF7                           1055
#define PORTG                         1056
#define CCP3                          1057
#define PA3                           1058
#define RG0                           1059
#define C3OUTG                        1060
#define PORTG_C3OUT                   1061
#define TX2                           1062
#define RG1                           1063
#define CK2                           1064
#define AN19                          1065
#define C3INA                         1066
#define RX2                           1067
#define RG2                           1068
#define DT2                           1069
#define AN18                          1070
#define CCP4                          1071
#define PD3                           1072
#define C3INB                         1073
#define RG3                           1074
#define AN17                          1075
#define CCP5                          1076
#define PD1                           1077
#define C3INC                         1078
#define T7CKI                         1079
#define T5G                           1080
#define RG4                           1081
#define RTCC                          1082
#define AN16                          1083
#define PORTG_RJPU                    1084
#define RG5                           1085
#define PORTH                         1086
#define RH0                           1087
#define A16                           1088
#define AN23                          1089
#define RH1                           1090
