tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k22_tdd.h
#define A17                           1091
#define AN22                          1092
#define RH2                           1093
#define A18                           1094
#define AN21                          1095
#define RH3                           1096
#define A19                           1097
#define AN20                          1098
#define PORTH_CCP9                    1099
#define RH4                           1100
#define C2INC                         1101
#define PC3                           1102
#define AN12                          1103
#define PORTH_CCP8                    1104
#define RH5                           1105
#define PB3                           1106
#define C2IND                         1107
#define AN13                          1108
#define C1INC                         1109
#define RH6                           1110
#define PORTH_CCP7                    1111
#define PC1                           1112
#define AN14                          1113
#define RH7                           1114
#define PORTH_CCP6                    1115
#define PB1                           1116
#define AN15                          1117
#define PORTJ                         1118
#define RJ0                           1119
#define ALE                           1120
#define RJ1                           1121
#define OE                            1122
#define RJ2                           1123
#define WRL                           1124
#define RJ3                           1125
#define WRH                           1126
#define RJ4                           1127
#define BA0                           1128
#define RJ5                           1129
#define CE                            1130
#define RJ6                           1131
#define LB                            1132
#define RJ7                           1133
#define UB                            1134
#define LATA                          1135
#define LATA0                         1136
#define LA0                           1137
#define LATA1                         1138
#define LA1                           1139
#define LATA2                         1140
#define LA2                           1141
#define LATA3                         1142
#define LA3                           1143
#define LATA4                         1144
#define LA4                           1145
#define LATA5                         1146
#define LA5                           1147
#define LATA6                         1148
#define LA6                           1149
#define LATA7                         1150
#define LA7                           1151
#define LATB                          1152
#define LB0                           1153
#define LATB0                         1154
#define LB1                           1155
#define LATB1                         1156
#define LB2                           1157
#define LATB2                         1158
#define LB3                           1159
#define LATB3                         1160
#define LB4                           1161
#define LATB4                         1162
#define LB5                           1163
#define LATB5                         1164
#define LB6                           1165
#define LATB6                         1166
#define LB7                           1167
#define LATB7                         1168
#define LATC                          1169
#define LATC0                         1170
#define LC0                           1171
#define LATC1                         1172
#define LC1                           1173
#define LATC2                         1174
#define LC2                           1175
#define LATC3                         1176
#define LC3                           1177
#define LATC4                         1178
#define LC4                           1179
#define LATC5                         1180
#define LC5                           1181
#define LATC6                         1182
#define LC6                           1183
#define LATC7                         1184
#define LC7                           1185
#define LATD                          1186
#define LATD0                         1187
#define LD0                           1188
#define LATD1                         1189
#define LD1                           1190
#define LATD2                         1191
#define LD2                           1192
#define LATD3                         1193
#define LD3                           1194
#define LATD4                         1195
#define LD4                           1196
#define LATD5                         1197
#define LD5                           1198
#define LATD6                         1199
#define LD6                           1200
#define LATD7                         1201
#define LD7                           1202
#define LATE                          1203
#define LATE0                         1204
#define LE0                           1205
#define LATE1                         1206
#define LE1                           1207
#define LATE2                         1208
#define LE2                           1209
#define LATE3                         1210
#define LE3                           1211
#define LATE4                         1212
#define LE4                           1213
#define LATE5                         1214
#define LE5                           1215
#define LATE6                         1216
#define LE6                           1217
#define LATE7                         1218
#define LE7                           1219
#define LATF                          1220
#define LATF1                         1221
#define LF1                           1222
#define LF2                           1223
#define LATF2                         1224
#define LF3                           1225
#define LATF3                         1226
#define LF4                           1227
#define LATF4                         1228
#define LF5                           1229
#define LATF5                         1230
#define LF6                           1231
#define LATF6                         1232
#define LF7                           1233
#define LATF7                         1234
#define LATG                          1235
#define LATG0                         1236
#define LG0                           1237
#define LATG1                         1238
#define LG1                           1239
#define LATG2                         1240
#define LG2                           1241
#define LATG3                         1242
#define LG3                           1243
#define LATG4                         1244
#define LG4                           1245
#define LATH                          1246
#define LH0                           1247
#define LATH0                         1248
#define LH1                           1249
#define LATH1                         1250
#define LH2                           1251
#define LATH2                         1252
#define LH3                           1253
#define LATH3                         1254
#define LH4                           1255
#define LATH4                         1256
#define LH5                           1257
#define LATH5                         1258
#define LH6                           1259
#define LATH6                         1260
#define LH7                           1261
#define LATH7                         1262
#define LATJ                          1263
#define LATJ0                         1264
#define LJ0                           1265
#define LATJ1                         1266
#define LJ1                           1267
#define LATJ2                         1268
#define LJ2                           1269
#define LATJ3                         1270
#define LJ3                           1271
#define LATJ4                         1272
#define LJ4                           1273
#define LATJ5                         1274
#define LJ5                           1275
#define LATJ6                         1276
#define LJ6                           1277
#define LATJ7                         1278
#define LJ7                           1279
#define TRISA                         1280
#define TRISA0                        1281
#define TRISA1                        1282
#define TRISA2                        1283
#define TRISA3                        1284
#define TRISA4                        1285
#define TRISA5                        1286
#define TRISA6                        1287
#define TRISA7                        1288
#define TRISB                         1289
#define TRISB0                        1290
#define TRISB1                        1291
#define TRISB2                        1292
#define TRISB3                        1293
#define TRISB4                        1294
#define TRISB5                        1295
#define TRISB6                        1296
#define TRISB7                        1297
#define TRISC                         1298
#define TRISC0                        1299
#define TRISC1                        1300
#define TRISC2                        1301
#define TRISC3                        1302
#define TRISC4                        1303
#define TRISC5                        1304
#define TRISC6                        1305
#define TRISC7                        1306
#define TRISD                         1307
#define TRISD0                        1308
#define TRISD1                        1309
#define TRISD2                        1310
#define TRISD3                        1311
#define TRISD4                        1312
#define TRISD5                        1313
#define TRISD6                        1314
#define TRISD7                        1315
#define TRISE                         1316
#define TRISE0                        1317
#define TRISE1                        1318
#define TRISE2                        1319
#define TRISE3                        1320
#define TRISE4                        1321
#define TRISE5                        1322
#define TRISE6                        1323
#define TRISE7                        1324
#define TRISF                         1325
#define TRISF1                        1326
#define TRISF2                        1327
#define TRISF3                        1328
#define TRISF4                        1329
#define TRISF5                        1330
#define TRISF6                        1331
#define TRISF7                        1332
#define TRISG                         1333
#define TRISG0                        1334
#define TRISG1                        1335
#define TRISG2                        1336
#define TRISG3                        1337
#define TRISG4                        1338
#define TRISH                         1339
#define TRISH0                        1340
#define TRISH1                        1341
#define TRISH2                        1342
#define TRISH3                        1343
#define TRISH4                        1344
#define TRISH5                        1345
#define TRISH6                        1346
#define TRISH7                        1347
#define TRISJ                         1348
#define TRISJ0                        1349
#define TRISJ1                        1350
#define TRISJ2                        1351
#define TRISJ3                        1352
#define TRISJ4                        1353
#define TRISJ5                        1354
#define TRISJ6                        1355
#define TRISJ7                        1356
#define OSCTUNE                       1357
#define TUN0                          1358
#define TUN                           1359
#define TUN1                          1360
#define TUN2                          1361
#define TUN3                          1362
#define TUN4                          1363
#define TUN5                          1364
#define PLLEN                         1365
#define INTSRC                        1366
#define PSTR1CON                      1367
#define PSTR1CON_STRA                 1368
#define PSTR1CON_STRB                 1369
#define PSTR1CON_STRC                 1370
#define PSTR1CON_STRD                 1371
#define PSTR1CON_STRSYNC              1372
#define PSTR1CON_CMPL0                1373
#define PSTR1CON_CMPL                 1374
#define PSTR1CON_CMPL1                1375
#define PIE1                          1376
#define TMR1IE                        1377
#define TMR2IE                        1378
#define TMR1GIE                       1379
#define SSP1IE                        1380
#define SSPIE                         1381
#define TXIE                          1382
#define TX1IE                         1383
#define RCIE                          1384
#define RC1IE                         1385
#define ADIE                          1386
#define PSPIE                         1387
#define PIR1                          1388
#define TMR1IF                        1389
#define TMR2IF                        1390
#define TMR1GIF                       1391
#define SSPIF                         1392
#define SSP1IF                        1393
#define TXIF                          1394
#define TX1IF                         1395
#define RCIF                          1396
#define RC1IF                         1397
#define ADIF                          1398
#define PSPIF                         1399
#define IPR1                          1400
#define TMR1IP                        1401
#define TMR2IP                        1402
#define TMR1GIP                       1403
#define SSPIP                         1404
#define SSP1IP                        1405
#define TX1IP                         1406
#define TXIP                          1407
#define RCIP                          1408
#define RC1IP                         1409
#define ADIP                          1410
#define PSPIP                         1411
#define PIE2                          1412
#define TMR3GIE                       1413
#define TMR3IE                        1414
#define HLVDIE                        1415
#define LVDIE                         1416
#define BCL1IE                        1417
#define BCLIE                         1418
#define BCL2IE                        1419
#define SSP2IE                        1420
#define OSCFIE                        1421
#define PIR2                          1422
#define TMR3GIF                       1423
#define TMR3IF                        1424
#define HLVDIF                        1425
#define LVDIF                         1426
#define BCLIF                         1427
#define BCL1IF                        1428
#define BCL2IF                        1429
#define SSP2IF                        1430
#define OSCFIF                        1431
#define IPR2                          1432
#define TMR3GIP                       1433
#define TMR3IP                        1434
#define HLVDIP                        1435
#define LVDIP                         1436
#define BCLIP                         1437
#define BCL1IP                        1438
#define BCL2IP                        1439
#define SSP2IP                        1440
#define OSCFIP                        1441
#define PIE3                          1442
#define RXB0IE                        1443
#define RTCCIE                        1444
#define RXBNIE                        1445
#define CCP1IE                        1446
#define RXB1IE                        1447
#define CCP2IE                        1448
#define TXB0IE                        1449
#define CTMUIE                        1450
#define TXB1IE                        1451
#define TXBNIE                        1452
#define TXB2IE                        1453
#define TX2IE                         1454
#define RC2IE                         1455
#define TMR5GIE                       1456
#define PIR3                          1457
#define RTCCIF                        1458
#define RXBNIF                        1459
#define CCP1IF                        1460
#define CCP2IF                        1461
#define CTMUIF                        1462
#define TXBNIF                        1463
#define TX2IF                         1464
#define RC2IF                         1465
#define TMR5GIF                       1466
#define IPR3                          1467
#define RTCCIP                        1468
#define CCP1IP                        1469
#define RXBNIP                        1470
#define CCP2IP                        1471
#define CTMUIP                        1472
#define TX2IP                         1473
#define TXBNIP                        1474
#define RC2IP                         1475
#define TMR5GIP                       1476
#define PIR6                          1477
#define CMP1IF                        1478
#define CMP2IF                        1479
#define CMP3IF                        1480
#define EEIF                          1481
#define PSPCON                        1482
#define PSPMODE                       1483
#define IBOV                          1484
#define OBF                           1485
#define IBF                           1486
#define HLVDCON                       1487
#define HLVDL                         1488
#define HLVDL0                        1489
#define HLVDL1                        1490
#define HLVDL2                        1491
#define HLVDL3                        1492
#define HLVDEN                        1493
#define IRVST                         1494
#define BGVST                         1495
#define VDIRMAG                       1496
#define IPR6                          1497
#define CMP1IP                        1498
#define CMP2IP                        1499
#define CMP3IP                        1500
#define EEIP                          1501
#define T1GCON                        1502
#define T1GSS0                        1503
#define T1GSS                         1504
#define T1GSS1                        1505
#define T1GVAL                        1506
#define T1GGO_nT1DONE                 1507
#define nT1DONE                       1508
#define T1GGO_NOT_T1DONE              1509
#define NOT_T1DONE                    1510
#define T1GGO                         1511
#define T1GSPM                        1512
#define T1GTM                         1513
#define T1GPOL                        1514
#define TMR1GE                        1515
#define RCSTA1                        1516
#define RCSTA1_RX9D                   1517
#define RX9D1                         1518
#define RCD8                          1519
#define RCSTA1_OERR                   1520
#define OERR1                         1521
#define RCSTA1_FERR                   1522
#define FERR1                         1523
#define RCSTA1_ADDEN                  1524
#define ADDEN1                        1525
#define ADEN                          1526
#define RCSTA1_CREN                   1527
#define CREN1                         1528
#define SRENA                         1529
#define SREN1                         1530
#define RCSTA1_SREN                   1531
#define RC8_9                         1532
#define RCSTA1_RX9                    1533
#define nRC8                          1534
#define NOT_RC8                       1535
#define RC9                           1536
#define RX91                          1537
#define RCSTA1_SPEN                   1538
#define SPEN1                         1539
#define TXSTA1                        1540
#define TX9D1                         1541
#define TXSTA1_TX9D                   1542
#define TXD8                          1543
#define TRMT1                         1544
#define TXSTA1_TRMT                   1545
#define BRGH1                         1546
#define TXSTA1_BRGH                   1547
#define TXSTA1_SENDB                  1548
#define SENDB1                        1549
#define TXSTA1_SYNC                   1550
#define SYNC1                         1551
#define TXEN1                         1552
#define TXSTA1_TXEN                   1553
#define TX91                          1554
#define TX8_9                         1555
#define NOT_TX8                       1556
#define nTX8                          1557
#define TXSTA1_TX9                    1558
#define TXSTA1_CSRC                   1559
#define CSRC1                         1560
#define TXREG1                        1561
#define RCREG1                        1562
#define SPBRG1                        1563
#define T3GCON                        1564
#define T3GSS0                        1565
#define T3GSS                         1566
#define T3GSS1                        1567
#define T3GVAL                        1568
#define T3GGO                         1569
#define NOT_T3DONE                    1570
#define nT3DONE                       1571
#define T3GGO_nT3DONE                 1572
#define T3GGO_NOT_T3DONE              1573
#define T3GSPM                        1574
#define T3GTM                         1575
#define T3GPOL                        1576
#define TMR3GE                        1577
#define T3CON                         1578
#define TMR3ON                        1579
#define T3CON_RD16                    1580
#define nT3SYNC                       1581
#define NOT_T3SYNC                    1582
#define SOSCEN3                       1583
#define T3CON_SOSCEN                  1584
#define T3CKPS0                       1585
#define T3CKPS                        1586
#define T3CKPS1                       1587
#define TMR3CS0                       1588
#define TMR3CS                        1589
#define TMR3CS1                       1590
#define T3RD16                        1591
#define RD163                         1592
#define TMR3L                         1593
#define TMR3H                         1594
#define CMSTAT                        1595
#define CMSTAT_C1OUT                  1596
#define CMP1OUT                       1597
#define CMSTAT_C2OUT                  1598
#define CMP2OUT                       1599
#define CMP3OUT                       1600
#define CMSTAT_C3OUT                  1601
#define CVRCON                        1602
#define CVR                           1603
#define CVR0                          1604
#define CVR1                          1605
#define CVR2                          1606
#define CVR3                          1607
#define CVR4                          1608
#define CVRR                          1609
#define CVRSS                         1610
#define CVROEN                        1611
#define CVROE                         1612
#define CVREN                         1613
#define PIE4                          1614
#define CCP3IE                        1615
#define CCP4IE                        1616
#define CCP5IE                        1617
#define CCP6IE                        1618
#define CCP7IE                        1619
#define CCP8IE                        1620
#define CCP9IE                        1621
#define CCP10IE                       1622
#define PIR4                          1623
#define CCP3IF                        1624
#define CCP4IF                        1625
#define CCP5IF                        1626
#define CCP6IF                        1627
#define CCP7IF                        1628
#define CCP8IF                        1629
#define CCP9IF                        1630
#define CCP10IF                       1631
#define IPR4                          1632
#define CCP3IP                        1633
#define CCIP3IP                       1634
#define CCP4IP                        1635
#define CCP5IP                        1636
#define CCP6IP                        1637
#define CCP7IP                        1638
#define CCP8IP                        1639
#define CCP9IP                        1640
#define CCP10IP                       1641
#define PIE5                          1642
#define TMR4IE                        1643
#define TMR5IE                        1644
#define TMR6IE                        1645
#define TMR7IE                        1646
#define TMR8IE                        1647
#define TMR10IE                       1648
